# PathReinShapen2 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathReinShapen2 Property
ParameterTypeId Class See Also
---
"Alternating Bar - Shape"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathReinShapen2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinShapen2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathReinShapen2 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace